{
    "format": "layers-model",
    "generatedBy": "keras v2.8.0",
    "convertedBy": "TensorFlow.js Converter v3.15.0",
    "modelTopology": {
        "keras_version": "2.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                225
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "layer_normalization_input"
                        }
                    },
                    {
                        "class_name": "LayerNormalization",
                        "config": {
                            "name": "layer_normalization",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                225
                            ],
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "layer1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 256,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "layer2",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 512,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "layer3",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1024,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "layer4",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 512,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "layer_out",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 208,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "mean_squared_error",
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adamax",
                "config": {
                    "name": "Adamax",
                    "learning_rate": {
                        "class_name": "ExponentialDecay",
                        "config": {
                            "initial_learning_rate": 0.01,
                            "decay_steps": 10000,
                            "decay_rate": 0.9,
                            "staircase": false,
                            "name": null
                        }
                    },
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of2.bin",
                "group1-shard2of2.bin"
            ],
            "weights": [
                {
                    "name": "layer1/kernel",
                    "shape": [
                        225,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer1/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer2/kernel",
                    "shape": [
                        256,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer2/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer3/kernel",
                    "shape": [
                        512,
                        1024
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer3/bias",
                    "shape": [
                        1024
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer4/kernel",
                    "shape": [
                        1024,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer4/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer_normalization/gamma",
                    "shape": [
                        225
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer_normalization/beta",
                    "shape": [
                        225
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer_out/kernel",
                    "shape": [
                        512,
                        208
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layer_out/bias",
                    "shape": [
                        208
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}